In [1]:
import numpy as np
import pandas as pd

In [2]:
t=pd.DataFrame(np.random.randint(1,100,12).reshape(3,4),index=list('acb'),columns=list('ACDB'))
t

    A   C   D   B
a  24   4  41  24
c  13  95  34  79
b  11  51  15   3

In [6]:
t.loc[['c'],['A']]=np.nan
t.loc[['b'],['B']]=np.nan
t

      A   C   D     B
a  24.0   4  41  24.0
c   NaN  95  34  79.0
b  11.0  51  15   NaN

In [7]:
t.describe()

               A          C          D          B
count   2.000000   3.000000   3.000000   2.000000
mean   17.500000  50.000000  30.000000  51.500000
std     9.192388  45.508241  13.453624  38.890873
min    11.000000   4.000000  15.000000  24.000000
25%    14.250000  27.500000  24.500000  37.750000
50%    17.500000  51.000000  34.000000  51.500000
75%    20.750000  73.000000  37.500000  65.250000
max    24.000000  95.000000  41.000000  79.000000

### 1. argmin（）、argmax（）、ldxmin（）、ldxmax（）

In [11]:
d=pd.Series(np.random.randint(1,100,5),index=list('abcde'))
d

a    35
b    96
c    47
d    31
e    33
dtype: int32

In [29]:
d.values.argmax()   #该方法代替d.argmax()

1

In [23]:
t

      A   C   D     B
a  24.0   4  41  24.0
c   NaN  95  34  79.0
b  11.0  51  15   NaN

In [26]:
t.idxmin(axis=0)

A    b
C    a
D    b
B    a
dtype: object

In [35]:
d.unique()

array([35, 96, 47, 31, 33], dtype=int64)

In [40]:
t.loc[:,'A'].unique()

array([24., nan, 11.])

In [41]:
d.value_counts()

47    1
35    1
31    1
33    1
96    1
dtype: int64

In [42]:
t.loc['a'].value_counts()   #元素出现频率计算

24.0    2
41.0    1
4.0     1
Name: a, dtype: int64

In [43]:
t.isin([10])  #判断10是否在t中

       A      C      D      B
a  False  False  False  False
c  False  False  False  False
b  False  False  False  False

In [47]:
t0=t.isin([24])
t0

       A      C      D      B
a   True  False  False   True
c  False  False  False  False
b  False  False  False  False

In [48]:
t[t0]

      A   C   D     B
a  24.0 NaN NaN  24.0
c   NaN NaN NaN   NaN
b   NaN NaN NaN   NaN

In [45]:
d.isin(['hello'])

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [49]:
t

      A   C   D     B
a  24.0   4  41  24.0
c   NaN  95  34  79.0
b  11.0  51  15   NaN

In [59]:
t[1]=np.nan
t

      A   C   D     B   1
a  24.0   4  41  24.0 NaN
c   NaN  95  34  79.0 NaN
b  11.0  51  15   NaN NaN

In [60]:
type(t)

pandas.core.frame.DataFrame

In [61]:
t

      A   C   D     B   1
a  24.0   4  41  24.0 NaN
c   NaN  95  34  79.0 NaN
b  11.0  51  15   NaN NaN

### 层次化索引

In [74]:
s=pd.Series(np.random.randint(1,100,4),index=[['a','a','b','b'],[1,2,1,2]])
s

a  1    83
   2    68
b  1    70
   2     1
dtype: int32

In [77]:
s=pd.Series(np.random.randint(1,100,4),index=[list('aabb'),list('1212')])
s

a  1    92
   2     2
b  1    30
   2    76
dtype: int32

In [85]:
s1=s.unstack()   #将s压扁
s1

    1   2
a  92   2
b  30  76

In [86]:
s1.stack()  #将压扁的s还原回去

a  1    92
   2     2
b  1    30
   2    76
dtype: int32

In [78]:
d=pd.DataFrame(np.arange(12).reshape(4,3),index=[list('aabb'),list('1212')],columns=[list('ABC'),list('xyz')])
d

     A   B   C
     x   y   z
a 1  0   1   2
  2  3   4   5
b 1  6   7   8
  2  9  10  11

In [80]:
d.unstack()

   A     B      C
   x     y      z
   1  2  1   2  1   2
a  0  3  1   4  2   5
b  6  9  7  10  8  11

### 合并

In [87]:
t

      A   C   D     B   1
a  24.0   4  41  24.0 NaN
c   NaN  95  34  79.0 NaN
b  11.0  51  15   NaN NaN

In [91]:
t.loc['b',1]='hello'
t

      A   C   D     B      1
a  24.0   4  41  24.0    NaN
c   NaN  95  34  79.0    NaN
b  11.0  51  15   NaN  hello

In [92]:
t.set_index(['B',1])

               A   C   D
B    1
24.0 NaN    24.0   4  41
79.0 NaN     NaN  95  34
NaN  hello  11.0  51  15

In [94]:
t

      A   C   D     B      1
a  24.0   4  41  24.0    NaN
c   NaN  95  34  79.0    NaN
b  11.0  51  15   NaN  hello
d   1.0   2   3   4.0      5

In [98]:
t.loc[:,'A']=[1,2,1,2]
t

   A   C   D     B      1
a  1   4  41  24.0    NaN
c  2  95  34  79.0    NaN
b  1  51  15   NaN  hello
d  2   2   3   4.0      5

In [99]:
t.loc[:,1]=['a','b','a','b']
t

   A   C   D     B  1
a  1   4  41  24.0  a
c  2  95  34  79.0  b
b  1  51  15   NaN  a
d  2   2   3   4.0  b

In [100]:
t.set_index(['A',1])

      C   D     B
A 1
1 a   4  41  24.0
2 b  95  34  79.0
1 a  51  15   NaN
2 b   2   3   4.0